# Problem 1

In [108]:
import pandas as pd 
import numpy as np

# Creating dataframe
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [109]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [111]:
# imputing missing values

df.iloc[1,1] = 10055
df.iloc[3,1] = 10075

In [112]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [113]:
df['FlightNumber'] = df['FlightNumber'].astype("int64")

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

# Problem 2

In [115]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [116]:
df.columns

Index(['From_To', 'FlightNumber', 'RecentDelays', 'Airline'], dtype='object')

In [117]:
# Spliting  From_to column on "_" delimiter

from_to= [i.split("_") for i in df.From_To]
from_to

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [118]:
from_col = [i[0] for i in from_to]
to_col = [i[1] for i in from_to]

print(from_col)
print()
print(to_col)

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [119]:
# creating a temporary dataframe
temp_df = pd.DataFrame({"From":from_col, "To":to_col})
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# Problem 3

In [120]:
from_cap = [i.capitalize() for i in temp_df['From']]
to_cap = [i.capitalize() for i in temp_df["To"]]

temp_df1 = pd.DataFrame({"From":from_cap, "To":to_cap}) 

temp_df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# Problem 4

In [121]:
df = df.drop("From_To", axis=1)

In [122]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [123]:
df1 = pd.concat([temp_df1,df], axis=1)
df1

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

# Problem 5

In [124]:
df1

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In [125]:
# Getting max list length in "RecentDelays"
max_delay_list_len = max([len(i) for i in df1['RecentDelays']])
max_delay_list_len

3

In [126]:
# Creating new dictionary with new column names as keys and 
# empty list to add values later
delay_dict = {}
for i in range(max_delay_list_len):
    delay_dict[f"delay_{i+1}"] = []

delay_dict

{'delay_1': [], 'delay_2': [], 'delay_3': []}

In [127]:
# Adding values to their respective Dictionary key
for i in range(max_delay_list_len):
    for lis in df1["RecentDelays"]:
        try:
            delay_dict[f"delay_{i+1}"].append(lis[i])
        except:
            delay_dict[f"delay_{i+1}"].append(np.nan)

In [128]:
# getting "RecentDelays" column position
recentDelays_pos = df1.columns.get_loc("RecentDelays")
recentDelays_pos

3

In [129]:
# Removing "RecentDelays" from dataframe
df1 = df1.drop("RecentDelays", axis=1)
df1

       From         To  FlightNumber              Airline
0    London      Paris         10045               KLM(!)
1    Madrid      Milan         10055    <Air France> (12)
2    London  Stockholm         10065  (British Airways. )
3  Budapest      Paris         10075       12. Air France
4  Brussels     London         10085          "Swiss Air"

In [130]:
new_col_pos = recentDelays_pos
for new_col in list(delay_dict.keys()):
    df1.insert(loc=new_col_pos, column=new_col, value=delay_dict[new_col])
    new_col_pos += 1

In [131]:
df1

,From,To,FlightNumber,delay_1,delay_2,delay_3,Airline
0,London,Paris,10045,23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,10075,13.0,NaN,NaN,12. Air France
4,Brussels,London,10085,67.0,32.0,NaN,"""Swiss Air"""